; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 172571 1 3 4 5 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared2 - mode
	thermograph0 - mode
	image3 - mode
	thermograph1 - mode
	Star1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 thermograph0)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
)
(:goal (and
	(have_image Phenomenon5 thermograph1)
	(have_image Star6 thermograph1)
	(have_image Phenomenon7 image3)
	(have_image Planet8 infrared2)
))

)

; plan
1. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 4
2. (turn_to satellite0 groundstation2 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 4
3. (calibrate satellite0 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 0 of 4
4. (turn_to satellite0 star6 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star6)
   goals met: 0 of 4
5. (take_image satellite0 star6 instrument2 thermograph1)
   added: (have_image star6 thermograph1)
   goals met: 1 of 4
6. (turn_to satellite0 planet8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet8)
   goals met: 1 of 4
7. (take_image satellite0 planet8 instrument2 infrared2)
   added: (have_image planet8 infrared2)
   goals met: 2 of 4
8. (turn_to satellite0 phenomenon5 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 phenomenon5)
   goals met: 2 of 4
9. (take_image satellite0 phenomenon5 instrument2 thermograph1)
   added: (have_image phenomenon5 thermograph1)
   goals met: 3 of 4
10. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 3 of 4
11. (turn_to satellite0 groundstation2 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 groundstation2)
   goals met: 3 of 4
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 4
13. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 3 of 4
14. (turn_to satellite0 phenomenon7 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 4
15. (take_image satellite0 phenomenon7 instrument1 image3)
   added: (have_image phenomenon7 image3)
   goals met: 4 of 4
